# There are 2 types of reccomendation systems - Content based and collaborative filtering.
## Content based R.S. , suggests a user a product which is popular .Like u1 likes apple,orange and banana , similarly u2 likes apple and orange , and lastly u3 likes only apple so our content based R.S. will tell u3 to purchase orange too.
## Collaborative filtering is like u1 likes pizza , burger and coke and u2 likes pizza and burger but has never tried coke so our collaborative filtering would reccoent u2 coke.Collaborative filtering gives more better result and is used frequently. Collaborative filtering is further classified into - Model based and memory based.

In [2]:
import numpy as np
import pandas as pd
import warnings

In [3]:
# We can ignore warning by using warnings.filterwarnongs('ignore')

# Getting the dataset , Our file is not csv but when we see that the dataset is tab seperated and hence we pass an argument as sep so that our file can be read easily.

In [11]:
column_names = ["user_id","item_id","rating","timestamp"] # This is given in the description of the file so we can add columns
# by passing it as argument when creating the dataframe.
df = pd.read_csv("ml-100k/u.data",sep='\t',names = column_names)

In [12]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [8]:
df.shape

(99999, 4)

In [13]:
# finding the unique user
df['user_id'].nunique()

943

In [14]:
# Finding unique movies i.e. item_id
df['item_id'].nunique()

1682

In [22]:
movies_titles = pd.read_csv("ml-100k/u.item",sep="\|",header = None) # Seeing item_no associated with which movie
print(movies_titles)

        0                                          1            2   3   \
0        1                           Toy Story (1995)  01-Jan-1995 NaN
1        2                           GoldenEye (1995)  01-Jan-1995 NaN
2        3                          Four Rooms (1995)  01-Jan-1995 NaN
3        4                          Get Shorty (1995)  01-Jan-1995 NaN
4        5                             Copycat (1995)  01-Jan-1995 NaN
...    ...                                        ...          ...  ..
1677  1678                          Mat' i syn (1997)  06-Feb-1998 NaN
1678  1679                           B. Monkey (1998)  06-Feb-1998 NaN
1679  1680                       Sliding Doors (1998)  01-Jan-1998 NaN
1680  1681                        You So Crazy (1994)  01-Jan-1994 NaN
1681  1682  Scream of Stone (Schrei aus Stein) (1991)  08-Mar-1996 NaN

                                                     4   5   6   7   8   9   \
0     http://us.imdb.com/M/title-exact?Toy%20Story%2...   0   0   0   1   1
1     http://us.imdb.com/M/title-exact?GoldenEye%20(...   0   1   1   0   0
2     http://us.imdb.com/M/title-exact?Four%20Rooms%...   0   0   0   0   0
3     http://us.imdb.com/M/title-exact?Get%20Shorty%...   0   1   0   0   0
4     http://us.imdb.com/M/title-exact?Copycat%20(1995)   0   0   0   0   0
...                                                 ...  ..  ..  ..  ..  ..
1677  http://us.imdb.com/M/title-exact?Mat%27+i+syn+...   0   0   0   0   0
1678  http://us.imdb.com/M/title-exact?B%2E+Monkey+(...   0   0   0   0   0
1679      http://us.imdb.com/Title?Sliding+Doors+(1998)   0   0   0   0   0
1680  http://us.imdb.com/M/title-exact?You%20So%20Cr...   0   0   0   0   0
1681  http://us.imdb.com/M/title-exact?Schrei%20aus%...   0   0   0   0   0

      ...  14  15  16  17  18  19  20  21  22  23
0     ...   0   0   0   0   0   0   0   0   0   0
1     ...   0   0   0   0   0   0   0   1   0   0
2     ...   0   0   0   0   0   0   0   1   0   0
3     ...   0   0   0   0   0   0   0   0   0   0
4     ...   0   0   0   0   0   0   0   1   0   0
...   ...  ..  ..  ..  ..  ..  ..  ..  ..  ..  ..
1677  ...   0   0   0   0   0   0   0   0   0   0
1678  ...   0   0   0   0   0   1   0   1   0   0
1679  ...   0   0   0   0   0   1   0   0   0   0
1680  ...   0   0   0   0   0   0   0   0   0   0
1681  ...   0   0   0   0   0   0   0   0   0   0

[1682 rows x 24 columns]

<ipython-input-22-8795cb5f421e>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies_titles = pd.read_csv("ml-100k/u.item",sep="\|",header = None) # Seeing item_no associated with which movie

In [24]:
# Now we just need movie number i.e. item_no and the title of that movie
movies_titles = movies_titles[[0,1]]
movies_titles.columns = ['item_id','title']
print(movies_titles.head())

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

# merging two dataframes i.e. df and movies_title

In [25]:
df = pd.merge(df,movies_titles,on = "item_id") # on is parameter which shows that on whivh basis df will merge
df.tail()

,user_id,item_id,rating,timestamp,title
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

# Exploratory data Analysis